DataProcessors/ВыгрузкаВЛогопорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаВЛогопорт</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/сабМаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>сабМаршрутныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМаршрутныхЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыПриняты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАдресов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаНаборку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КроссДокинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресТочкиПерегрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставкиДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМаршрутныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.сабМаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПаллет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
								<v8:Type>cfg:DocumentRef.сабМаршрутныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаВозвратОтКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УЧ_ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.РозничнаяПродажа</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.УЧ_Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.УЧ_ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.УЧ_Возврат</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыМаршрутныхЛистов</v8:Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаказовПоставщикам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗаказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложенныйМЛ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.сабМаршрутныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтообновленияЗаблокированы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНаОплатуПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ВыгрузкаВЛогопорт/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда		
		ТекстСообщения = НСтр(
		"ru='Для данной операции необходимо
		|установить расширение работы с файлами!
		|Установка выполняется в разделе
		|""Сервис и администрирование""/
		|""Настройка сервисных функций"".'"
		);
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.Каталог = ПутьКФайлу;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок = НСтр("ru = 'Выберите каталог'");
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолулчитьСтруктуруЗаказа(ТекЗаказ, ТекКроссДокинг)
	
	Если ТипЗнч(ТекЗаказ) = Тип("ДокументСсылка.сабМаршрутныйЛист") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	""NP381"" КАК CCODE,
		|	""3665817038"" КАК SHIPID,
		|	"""" КАК ORDNR,
		|	ЗаказПоставщику.Номер КАК DLVNR,
		|	ЗаказПоставщику.ДатаПоступления КАК ORDTE,
		|	1 КАК RMENG,
		|	""НАШ ПАРТНЕР ООО"" КАК VNAME,
		|	""00-000008"" КАК VCODE,
		|	"""" КАК ADINF,
		|	0 КАК MCOST,
		|	1 КАК POSNR,
		|	""БП-00002883"" КАК MATNR,
		|	ЗаказПоставщику.КоличествоПаллет КАК MMENG,
		|	ЗаказПоставщику.Вес КАК Weight,
		|	""PCE"" КАК MEINH,
		|	0 КАК PRICE,
		|	"""" КАК BBDDT,
		|	ЗаказПоставщику.КоличествоПаллет КАК NMPQuantity,
		|	ИСТИНА КАК KrossDoc
		|ИЗ
		|	Документ.сабМаршрутныйЛист КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекЗаказ);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СтруктураЗаказа = Новый Структура("CCODE, SHIPID, ORDNR, DLVNR, ORDTE, RMENG, VNAME, VCODE, ADINF, MCOST, Weight, NMPQuantity, KrossDoc");
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураЗаказа, Выборка);
			МассивСтрок = Новый Массив;
			СтруктураСтроки = Новый Структура("POSNR, MATNR, MMENG, MEINH, PRICE, BBDDT");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);
			МассивСтрок.Добавить(СтруктураСтроки);
			СтруктураЗаказа.Вставить("Товары", МассивСтрок);
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	""NP381"" КАК CCODE,
		|	ЗаказПоставщику.Контрагент.ИНН КАК SHIPID,
		|	"""" КАК ORDNR,
		|	ЗаказПоставщику.Номер КАК DLVNR,
		|	ЗаказПоставщику.ДатаПоступления КАК ORDTE,
		|	1 КАК RMENG,
		|	ЗаказПоставщику.Контрагент.Наименование КАК VNAME,
		|	ЗаказПоставщику.Контрагент.Код КАК VCODE,
		|	"""" КАК ADINF,
		|	ЗаказПоставщику.СуммаДокумента КАК MCOST,
		|	ЗаказПоставщику.ТабличнаяЧасть.(
		|		НомерСтроки КАК POSNR,
		|		Номенклатура.Код КАК MATNR,
		|		Количество КАК MMENG,
		|		ЕдиницаИзмерения КАК MEINH,
		|		Цена КАК PRICE,
		|		"""" КАК BBDDT,
		|		КоличествоУпаковок КАК КоличествоУпаковок
		|	) КАК ТабличнаяЧасть,
		|	ЗаказПоставщику.ВесТовара КАК Weight,
		|	0 КАК NMPQuantity,
		|	&ЭтоКроссДок КАК KrossDoc
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекЗаказ);
		Запрос.УстановитьПараметр("ЭтоКроссДок", ТекКроссДокинг);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СтруктураЗаказа = Новый Структура("CCODE, SHIPID, ORDNR, DLVNR, ORDTE, RMENG, VNAME, VCODE, ADINF, MCOST");
		Если ТекКроссДокинг Тогда
			СтруктураЗаказа.Вставить("Weight");	
			СтруктураЗаказа.Вставить("NMPQuantity");
			СтруктураЗаказа.Вставить("KrossDoc");
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураЗаказа, Выборка);
			ВыборкаТЧ = Выборка.ТабличнаяЧасть.Выгрузить();
			СтруктураЗаказа.RMENG = ВыборкаТЧ.Количество();
			Если ТекКроссДокинг Тогда
				СтруктураЗаказа.NMPQuantity = ВыборкаТЧ.Итог("КоличествоУпаковок");
				СтруктураЗаказа.Weight = ВыборкаТЧ.Итог("MMENG");
			КонецЕсли;
			
			МассивСтрок = Новый Массив;
			Для каждого ТекСтрока Из ВыборкаТЧ Цикл
				СтруктураСтроки = Новый Структура("POSNR, MATNR, MMENG, MEINH, PRICE, BBDDT");
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
				Если ТекКроссДокинг Тогда
					СтруктураСтроки.MMENG = ТекСтрока.КоличествоУпаковок;
				КонецЕсли;
				МассивСтрок.Добавить(СтруктураСтроки);
			КонецЦикла;
			СтруктураЗаказа.Вставить("Товары", МассивСтрок);
			
		КонецЦикла;
		
	КонецЕсли;
	
    Возврат СтруктураЗаказа;
	
КонецФункции

&НаСервере
Функция ПолулчитьСтруктуруЗаказаКлиента(ТекЗаказ, ТекКроссДокинг)
	
	Если ТипЗнч(ТекЗаказ) = Тип("ДокументСсылка.сабМаршрутныйЛист") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	""NP381"" КАК CCODE,
		|	"""" КАК SHIPID,
		|	ЗаказКлиента.Номер КАК SFNR,
		|	ЗаказКлиента.Номер КАК ORDNR,
		|	ЗаказКлиента.Номер КАК DLVNR,
		|	ЗаказКлиента.Дата КАК ORDTE,
		|	1 КАК RMENG,
		|	""Кросс-Докинг Самовывоз Наш Партнёр"" КАК SNAME,
		|	""00-000008"" КАК VCODE,
		|	"""" КАК ADINF,
		|	0 КАК MCOST,
		|	1 КАК POSNR,
		|	""БП-00003021"" КАК MATNR,
		|	ЗаказКлиента.Вес КАК MMENG,
		|	""PCE"" КАК MEINH,
		|	0 КАК PRICE,
		|	"""" КАК BBDDT,
		|	ЗаказКлиента.Вес КАК КоличествоУпаковок,
		|	ЗаказКлиента.Дата КАК SDATE,
		|	"""" КАК SADDR,
		|	"""" КАК SINNN,
		|	""00000001968"" КАК SHPID,
		|	1 КАК STATUS,
		|	ИСТИНА КАК UCHNDS,
		|	ИСТИНА КАК NDSVSUMME,
		|	ЗаказКлиента.Вес КАК Weight,
		|	ЗаказКлиента.КоличествоПаллет КАК NMPQuantity,
		|	ИСТИНА КАК KrossDoc
		|ИЗ
		|	Документ.сабМаршрутныйЛист КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекЗаказ);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СтруктураЗаказа = Новый Структура("CCODE, SFNR, SHIPID, ORDNR, DLVNR, ORDTE, RMENG, SNAME, VCODE, ADINF, MCOST, SDATE, SADDR, SINNN, SHPID, STATUS, UCHNDS, NDSVSUMME, Weight, NMPQuantity, KrossDoc");

		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураЗаказа, Выборка);
			
			МассивСтрок = Новый Массив;
			СтруктураСтроки = Новый Структура("POSNR, MATNR, MMENG, MEINH, PRICE, BBDDT");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);
			МассивСтрок.Добавить(СтруктураСтроки);
			СтруктураЗаказа.Вставить("Товары", МассивСтрок);
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	""NP381"" КАК CCODE,
		|	ЗаказКлиента.Контрагент.ИНН КАК SHIPID,
		|	ЕСТЬNULL(СчетФактураВыданный.Номер, ЗаказКлиента.Номер) КАК SFNR,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Номер, ЗаказКлиента.Номер) КАК ORDNR,
		|	ЗаказКлиента.Номер КАК DLVNR,
		|	ЗаказКлиента.Дата КАК ORDTE,
		|	1 КАК RMENG,
		|	ЗаказКлиента.Контрагент.Наименование КАК SNAME,
		|	ЗаказКлиента.Контрагент.Код КАК VCODE,
		|	"""" КАК ADINF,
		|	ЗаказКлиента.СуммаДокумента КАК MCOST,
		|	ЗаказКлиента.ТабличнаяЧасть.(
		|		НомерСтроки КАК POSNR,
		|		Номенклатура.Код КАК MATNR,
		|		Количество КАК MMENG,
		|		ЕдиницаИзмерения КАК MEINH,
		|		Цена КАК PRICE,
		|		ДОБАВИТЬКДАТЕ(ЗаказКлиента.Дата, ДЕНЬ, ЗаказКлиента.ТабличнаяЧасть.Номенклатура.СрокГодности) КАК BBDDT,
		|		КоличествоУпаковок КАК КоличествоУпаковок
		|	) КАК ТабличнаяЧасть,
		|	ЗаказКлиента.ДатаПоступления КАК SDATE,
		|	ЗаказКлиента.АдресДоставки КАК SADDR,
		|	ЗаказКлиента.Контрагент.ИНН КАК SINNN,
		|	ЗаказКлиента.ПодразделениеКонтрагента.Код КАК SHPID,
		|	1 КАК STATUS,
		|	ЗаказКлиента.УчитыватьНДС КАК UCHNDS,
		|	ЗаказКлиента.ЦенаВключаетНДС КАК NDSVSUMME,
		|	ЗаказКлиента.ВесТовара КАК Weight,
		|	0 КАК NMPQuantity,
		|	&ЭтоКроссДок КАК KrossDoc
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|			ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
		|				И (СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ)
		|		ПО ЗаказКлиента.Ссылка = РеализацияТоваровУслуг.Заказ
		|			И (РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекЗаказ);
		Запрос.УстановитьПараметр("ЭтоКроссДок", ТекКроссДокинг);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СтруктураЗаказа = Новый Структура("CCODE, SFNR, SHIPID, ORDNR, DLVNR, ORDTE, RMENG, SNAME, VCODE, ADINF, MCOST, SDATE, SADDR, SINNN, SHPID, STATUS, UCHNDS, NDSVSUMME");
		Если ТекКроссДокинг Тогда
			СтруктураЗаказа.Вставить("Weight");	
			СтруктураЗаказа.Вставить("NMPQuantity");
			СтруктураЗаказа.Вставить("KrossDoc");
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураЗаказа, Выборка);
			ВыборкаТЧ = Выборка.ТабличнаяЧасть.Выгрузить();
			СтруктураЗаказа.RMENG = ВыборкаТЧ.Количество();
			
			МассивСтрок = Новый Массив;
			Для каждого ТекСтрока Из ВыборкаТЧ Цикл
				СтруктураСтроки = Новый Структура("POSNR, MATNR, MMENG, MEINH, PRICE, BBDDT");
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
				Если ТекКроссДокинг Тогда
					СтруктураСтроки.MMENG = ТекСтрока.КоличествоУпаковок;
				КонецЕсли;
				МассивСтрок.Добавить(СтруктураСтроки);
			КонецЦикла;
			СтруктураЗаказа.Вставить("Товары", МассивСтрок);
			
			Если ТекКроссДокинг Тогда
				СтруктураЗаказа.NMPQuantity = ВыборкаТЧ.Итог("КоличествоУпаковок");
				СтруктураЗаказа.Weight = ВыборкаТЧ.Итог("MMENG");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	        
    Возврат СтруктураЗаказа;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьФайлы(Команда)
	
	ЗаписатьCSV("", ПутьКФайлу + "\users.csv");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьCSV(текст,имяФайла)
	
	Для каждого ТекЗаказ Из ЗаказыПоставщикам Цикл
		
		ТекКроссДокинг = ТекЗаказ.ТранзитныйГруз;
		Выборка = ПолулчитьСтруктуруЗаказа(ТекЗаказ.ЗаказПоставщику, ТекКроссДокинг);
		
		ЗаписьXML = Новый ЗаписьXML;
		
		ЗаписьXML.ОткрытьФайл(ПутьКФайлу+ "\Inbound_" + Выборка.DLVNR + "_" + Формат(Выборка.ORDTE, "ДФ=yyyyMMddhhmmss") + ".xml", "UTF-8"); //Открываем файл для записи, указываем кодировку
		
		ЗаписьXML.ЗаписатьОбъявлениеXML();  // Записываем объявление XML
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("INBNOTIFICATION");
		ЗаписьXML.ЗаписатьНачалоЭлемента("ORDHD"); // 
		ЗаписьXML.ЗаписатьАтрибут("CCODE", Выборка.CCODE);
		ЗаписьXML.ЗаписатьАтрибут("SHIPID", Выборка.SHIPID);
		ЗаписьXML.ЗаписатьАтрибут("ORDNR", Выборка.ORDNR); 
		ЗаписьXML.ЗаписатьАтрибут("DLVNR", Выборка.DLVNR);
		ЗаписьXML.ЗаписатьАтрибут("ORDTE", Формат(Выборка.ORDTE, "ДФ=yyyyMMdd"));
		ЗаписьXML.ЗаписатьАтрибут("RMENG", Формат(Выборка.RMENG, "ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("VNAME", Выборка.VNAME);
		ЗаписьXML.ЗаписатьАтрибут("VCODE", Выборка.VCODE);
		ЗаписьXML.ЗаписатьАтрибут("ADINF", Выборка.ADINF);
		ЗаписьXML.ЗаписатьАтрибут("MCOST", Формат(Выборка.MCOST, "ЧГ=0; ЧРД=."));
		
		Если ТекКроссДокинг Тогда
			ЗаписьXML.ЗаписатьАтрибут("Weight", Формат(Выборка.Weight * ?(КоэффициентБрутто, КоэффициентБрутто, 1), "ЧГ=0; ЧРД=."));
			ЗаписьXML.ЗаписатьАтрибут("NMPQuantity", Формат(Выборка.NMPQuantity, "ЧГ=0; ЧРД=."));
			ЗаписьXML.ЗаписатьАтрибут("KrossDoc", Строка(?(Выборка.KrossDoc, "Истина", "Ложь")));
		КонецЕсли;
		
		Для каждого ТекСтрока Из Выборка.Товары Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ORDRW"); // Начало элемента Организация
			
			ЗаписьXML.ЗаписатьАтрибут("POSNR", Формат(ТекСтрока.POSNR, "ЧГ=0"));
			ЗаписьXML.ЗаписатьАтрибут("MATNR", Строка(ТекСтрока.MATNR));
			ЗаписьXML.ЗаписатьАтрибут("MMENG", Формат(ТекСтрока.MMENG, "ЧГ=0; ЧРД=."));
			ЗаписьXML.ЗаписатьАтрибут("MEINH", Строка(?(ТекКроссДокинг, "PCE", ТекСтрока.MEINH)));
			ЗаписьXML.ЗаписатьАтрибут("PRICE", Формат(ТекСтрока.PRICE, "ЧГ=0; ЧРД=."));
			//ЗаписьXML.ЗаписатьАтрибут("BBDDT", Строка(ТекСтрока.BBDDT));
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
	КонецЦикла;
	
	Для каждого ТекЗаказ Из ЗаказыКлиентов Цикл
		
		ТекКроссДокинг = ТекЗаказ.ТранзитныйГруз;
		
		Выборка = ПолулчитьСтруктуруЗаказаКлиента(ТекЗаказ.ЗаказКлиента, ТекКроссДокинг);
		
		ЗаписьXML = Новый ЗаписьXML;
		
		ЗаписьXML.ОткрытьФайл(ПутьКФайлу+ "\Outbound_" + Выборка.DLVNR + "_" + Формат(Выборка.ORDTE, "ДФ=yyyyMMddhhmmss") + ".xml", "UTF-8"); //Открываем файл для записи, указываем кодировку
		
		ЗаписьXML.ЗаписатьОбъявлениеXML();  // Записываем объявление XML
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("SHPNOTIFICATION");
		ЗаписьXML.ЗаписатьНачалоЭлемента("ORDHD"); 
		ЗаписьXML.ЗаписатьАтрибут("CCODE", Выборка.CCODE);
		ЗаписьXML.ЗаписатьАтрибут("SHIPID", Выборка.SHIPID);
		ЗаписьXML.ЗаписатьАтрибут("ORDNR", Выборка.ORDNR); 
		ЗаписьXML.ЗаписатьАтрибут("DLVNR", Выборка.DLVNR);
		ЗаписьXML.ЗаписатьАтрибут("ORDTE", Формат(Выборка.ORDTE, "ДФ=yyyyMMdd"));
		ЗаписьXML.ЗаписатьАтрибут("RMENG", Формат(Выборка.RMENG, "ЧГ=0"));
		ЗаписьXML.ЗаписатьАтрибут("SNAME", Выборка.SNAME);
		//ЗаписьXML.ЗаписатьАтрибут("VCODE", Выборка.VCODE);
		ЗаписьXML.ЗаписатьАтрибут("ADINF", Выборка.ADINF);
		ЗаписьXML.ЗаписатьАтрибут("MCOST", Формат(Выборка.MCOST, "ЧГ=0; ЧРД=."));
		ЗаписьXML.ЗаписатьАтрибут("SFNR", Выборка.SFNR);
		ЗаписьXML.ЗаписатьАтрибут("SDATE", Формат(Выборка.SDATE, "ДФ=yyyyMMdd"));
		ЗаписьXML.ЗаписатьАтрибут("SADDR", Выборка.SADDR);
		ЗаписьXML.ЗаписатьАтрибут("SINNN", Выборка.SINNN);
		ЗаписьXML.ЗаписатьАтрибут("SHPID", Выборка.SHPID);
		ЗаписьXML.ЗаписатьАтрибут("STATUS", Строка(Выборка.STATUS));
		ЗаписьXML.ЗаписатьАтрибут("UCHNDS", Строка(Выборка.UCHNDS));
		ЗаписьXML.ЗаписатьАтрибут("NDSVSUMME", Строка(Выборка.NDSVSUMME));
		
		Если ТекКроссДокинг Тогда
			ЗаписьXML.ЗаписатьАтрибут("Weight", Формат(Выборка.Weight * ?(КоэффициентБрутто, КоэффициентБрутто, 1), "ЧГ=0; ЧРД=."));
			ЗаписьXML.ЗаписатьАтрибут("NMPQuantity", Формат(Выборка.NMPQuantity, "ЧГ=0; ЧРД=."));
			ЗаписьXML.ЗаписатьАтрибут("KrossDoc", Строка(?(Выборка.KrossDoc, "Истина", "Ложь")));
		КонецЕсли;
		
		Для каждого ТекСтрока Из Выборка.Товары Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ORDRW"); 
			
			ЗаписьXML.ЗаписатьАтрибут("POSNR", Формат(ТекСтрока.POSNR, "ЧГ=0"));
			ЗаписьXML.ЗаписатьАтрибут("MATNR", Строка(ТекСтрока.MATNR));
			ЗаписьXML.ЗаписатьАтрибут("MMENG", Формат(ТекСтрока.MMENG, "ЧГ=0; ЧРД=."));
			ЗаписьXML.ЗаписатьАтрибут("MEINH", Строка(?(ТекКроссДокинг, "PCE", ТекСтрока.MEINH)));
			ЗаписьXML.ЗаписатьАтрибут("PRICE", Формат(ТекСтрока.PRICE, "ЧГ=0; ЧРД=."));
			ЗаписьXML.ЗаписатьАтрибут("BBDDT", Формат(ТекСтрока.BBDDT, "ДФ=yyyyMMdd"));
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
	КонецЦикла;
	
	Сообщения = "Файлы созданы";
	
КонецПроцедуры


&НаКлиенте
Процедура КроссДокингПриИзменении(Элемент)
	Элементы.КоличествоПаллет.Доступность = КроссДокинг;
	Элементы.КоэффициентБрутто.Доступность = КроссДокинг;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КроссДокингПриИзменении(Неопределено);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоПаллет = 1;
	КоэффициентБрутто = 1.08;
	
	Если Параметры.Свойство("Документ") Тогда
		ЗаполнитьЗаказамиИзМЛ(Параметры.Документ);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказамиИзМЛ(МаршрутныйЛист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента КАК ЗаказКлиента,
	               |	ЕСТЬNULL(сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента.ТранзитныйГруз, сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента.КроссДокинг) КАК ТранзитныйГруз,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента) = ТИП(Документ.ЗаказКлиента)
	               |			ТОГДА сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента.ДатаПоступления
	               |		ИНАЧЕ сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента.Дата
	               |	КОНЕЦ КАК ДатаОтгрузки,
	               |	сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента.ДатаПоступления КАК ДатаТранзитнойОтгрузки
	               |ИЗ
	               |	Документ.сабМаршрутныйЛист.ТабличнаяЧасть КАК сабМаршрутныйЛистТабличнаяЧасть
	               |ГДЕ
	               |	сабМаршрутныйЛистТабличнаяЧасть.Ссылка = &Ссылка
	               |	И (ТИПЗНАЧЕНИЯ(сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента) = ТИП(Документ.ЗаказКлиента)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента) = ТИП(Документ.СабМаршрутныйЛист))";
	
	Запрос.УстановитьПараметр("Ссылка", МаршрутныйЛист);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ЗаказыКлиентов.Очистить();
	ЗаказыПоставщикам.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЗаказыКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Дата = Выборка.ДатаОтгрузки;
		
		Если Выборка.ТранзитныйГруз И ТипЗнч(Выборка.ЗаказКлиента) = Тип("ДокументСсылка.сабМаршрутныйЛист") Тогда
			НоваяСтрока = ЗаказыПоставщикам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ЗаказПоставщику = Выборка.ЗаказКлиента;
			НоваяСтрока.Дата = Выборка.ДатаТранзитнойОтгрузки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
